using System;

using Learning;

// не давай имена проектам с русскими буквами или пробелами
// bulls and cows
// русские буквы плохо, потому что у китайца, который будет запускать твою прогу, не будет русского языка
// пробелы плохо, потому что прогу при запуске через скрипт надо будет засовывать в кавычки
// а еще аргументы в кавычки и получается ересь в кавычках
// называй проекты по-англицки в ПаскальСтиле - каждое слово с большой буквы
namespace BullsAndCows
{
	// не надо плодить кучу солюшенов.
	// достаточно один солюшен, он связан с твоим обучением
	// и добавлять в него новые проекты
	// правый клик на солюшен, и Add new project

	// файл Utils.cs я включил как ссылку на файл из другого проекта
	// если файл поменять там или тут, он автоматически изменится и в другом проекте
	// не надо таскать или копировать код туда-сюда, он один на всех, и это норм
	// поскольку файл Utils может дергаться из разных проектов, я засунул его
	// в namespace Learning. и выше ты можешь увидеть 
	// using Learning; 
	// чтобы Utils стал доступен из кода

	// эти комменты можно удалить

	class Program
	{
		static void Main( string[] args )
		{ 
			// не надо изобретать колеса
			// измени на Utils.AskUserForString()
			Console.WriteLine( "введите загадываемое число" );
			// вводится загадываемое число
			string number = Console.ReadLine();
			// пишешь, что вводится загадываемое число, а ниже используешь как количество попыток
			// WTF?
			// NB в плохом коде возникает много WTF, в хорошем мало
			// number & number1 - ничего не говорящие имена
			// number - это строка
			// number.Length - это длина строки
			// как ты длину строки используешь как количество попыток? 
			// получается "hello" и "55555" дают тебе 5 попыток? 
			// WTF ?
			// чтобы строку преобразовать в число используй int.Parse(str)

			int bull = 0;
			int cow = 0;
			for (int i = 0; i<number.Length; i++ ) // количество попыток
			{
				// измени на Utils.AskUserForString()
				Console.WriteLine( "введите свой вариант" );
				string number1 = Console.ReadLine(); // вводится загадываемое число

				// остальное пока не смотрел
				for (int k = 0; k < number1.Length; k++) // проверка на быка
				{
					
					if (number1[ k ] == number[ k ])
					{
						bull = bull + 1;                    // счетчик сколько быков
					}
					else
					{
						for (int s = 0; s < number.Length; s++)
						{
							if (number1[ k ] == number[ s ])
							{
								cow = cow + 1;                 // счетчик на корову

							}
								
						}
					}
					

				}
				Console.WriteLine( "быков {0}", bull );
				Console.WriteLine( "коров {0}", cow );

			}
		}
	}
}
